{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title"},{"path":["body"],"id":"body","weight":1,"src":"body"}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"💵  Pricing","n":0.707},"1":{"v":"\n| License                   | Type                   | Price                                   |\n|---------------------------|------------------------|-----------------------------------------|\n| [[integrations.dokan]]    | Subscription           | ₹51,788.00 / $619.52 (18% tax included) |\n| [[integrations.fpd]]      | Licence & Subscription | $59.00 per license \\| $19 per month     |\n| [[integrations.razorpay]] | Commission             | 2-3%                                    |\n| WordPress                 | Subscription           | ₹640.00 / $7.70 per month               |\n| [[integrations.zoho]]     | Subscription           | ₹180 / $2.16 per month                  |\n\n## WordPress\n\n> Adapted from [WordPress Pricing](https://wordpress.com/pricing/)\n\n**Creator Plan** ₹640.00 / $7.70 per month\n\nWe are currently using the Creator Plan for WP, without this, we would not have access to most of the integrations we are using.\n\n## Integrations\n\n### Dokan\n\n![[integrations.dokan#pricing]]\n\n### Fancy Product Designer\n\n![[integrations.fpd]]\n\n### RazorPay\n\n![[integrations.razorpay#pricing]]\n\n### Zoho Campaigns\n\n![[integrations.zoho#pricing]]\n","n":0.1}}},{"i":2,"$":{"0":{"v":"🔧  Maintinence","n":0.707},"1":{"v":"\n# Update\n\n> All updates can be managed [here](https://mundocards.wpcomstaging.com/wp-admin/update-core.php).\n\nOccasionally the WordPress version will need to be updated manually.\n\nAll of the integrations are set to automatically schedule updates late in the evenings as to not disturb site usage.\n\n# Site Health\n\n> WordPress provides a site health checker which can be found [here](https://mundocards.wpcomstaging.com/wp-admin/site-health.php).\n\n- **Performance Monitoring**: The tool monitors your website's performance metrics, including page load times, server response times, and overall site speed. It provides recommendations for improving performance based on these metrics.\n- **Security Analysis**: It scans your website for potential security vulnerabilities, such as outdated plugins or themes, weak passwords, and suspicious file changes. It offers recommendations to strengthen your website's security and protect it from cyber threats.\n- **Plugin and Theme Checks**: The tool reviews the plugins and themes installed on your website, checking for compatibility issues, outdated versions, and known security vulnerabilities. It suggests updates or replacements for problematic plugins and themes.\n- **Site Health Score**: It assigns a health score to your website based on various factors, including performance, security, and overall site maintenance. This score helps you gauge the overall health of your website and prioritize necessary improvements.\n- **Actionable Recommendations**: The tool provides actionable recommendations to address any issues identified during the health check. These recommendations are tailored to your website's specific needs and can help you optimize its performance and security.\n- **Scheduled Checks**: You can schedule regular health checks for your website to ensure ongoing monitoring and maintenance. This helps you stay proactive in addressing potential issues and keeping your website running smoothly.\n","n":0.063}}},{"i":3,"$":{"0":{"v":"🔌  Integrations","n":0.707},"1":{"v":"\n![Sequence Diagram](assets/sequence_diagram.jpg)\n\n## E-commerce and Payment\n\n- **[[integrations.razorpay]]**: Payment gateway for transactions.\n- **[[integrations.woocommerce]]**: Comprehensive e-commerce platform.\n- **[[integrations.dokan]]**: Manages Vendors & provides vendor dashboard.\n<!-- - **WC Vendors Marketplace**: Marketplace creation with vendor management. -->\n<!-- - **WC Captcha**: Adds captcha to WooCommerce forms to prevent spam and secure the site from bots. -->\n\n## Website and Content Management\n\n- **All-in-One WP Migration**: Site migration, backup, and content import/export.\n- **Classic Widgets**: Classic widget management for appearance.\n- **Elementor**: Drag-and-drop page builder for website design.\n- **ElementsKit Lite**: Advanced Elementor addons for design and layout.\n- **Jeg Elementor Kit**: Additional widgets for Elementor.\n- **Essential Addons for Elementor**: Extra elements and widgets for Elementor.\n\n## Marketing and Customer Engagement\n\n<!-- - **Contact Form 7**: Creation of contact forms. -->\n- **Mailchimp for WooCommerce**: Email marketing and customer segmentation.\n<!-- - SMSAlert - WooCommerce: SMS notifications for orders and customer engagement. -->\n- **WPForms Lite**: Drag-and-drop form builder for contact and surveys.\n- **[[integrations.zoho]]**: Convert visitors into leads, sync WooCommerce details, and set up targeted campaigns.\n\n## Performance and Security\n\n- **Jetpack**: Security, performance, and marketing tools.\n- **WP-Optimize**: Cleans database, compresses images, and caches the site for improved performance.\n<!-- - WP Super Cache: Generates static HTML files for faster load times. -->\n<!-- - WP Armour – Honeypot Anti-Spam: Protects forms from spam using the honeypot technique. -->\n\n## User Experience and Customization\n\n- **Custom Fonts**: Custom and Google fonts for website typography.\n- **[[integrations.fpd]]**: Customize/personalize visiting card templates\n- **Nav Menu Roles**: Menu item visibility based on user roles.\n- **User Switching**: Allows switching between user accounts easily.\n\n## Analytics and SEO\n\n- **WP Statistics**: Provides detailed statistics about website visitors and page views.\n<!-- - **Site Kit by Google**: Integrates insights from Google Analytics, Search Console, AdSense, and PageSpeed Insights. -->\n- **Yoast SEO**: Optimizes website content for search engines with keywords, meta descriptions, and readability analysis.\n","n":0.059}}},{"i":4,"$":{"0":{"v":"Zoho Campaigns","n":0.707},"1":{"v":"\nZoho campaigns provides automated emails for WooCommerce orders\nfor MundoCards.\n\n## Links\n\n- [Dashboard](https://campaigns.zoho.com/campaigns/org849678240/home.do#dashboard)\n- [Automations](https://campaigns.zoho.com/campaigns/org849678240/home.do#automation/advworkflows)\n\n## Key Features\n\nZoho Campaigns is an integral part of Zoho's suite of business tools, providing robust email marketing solutions designed to enhance sales and maximize user engagement. Below are the key functionalities offered by Zoho Campaigns:\n\n- **Email Campaign Management**: Customize your marketing communications with tailored content that resonates with various customer segments. Utilize advanced conditional workflows to ensure that the right messages reach the right audience at the optimal time.\n- **Integration of Signup Forms**: Easily integrate signup forms into your WordPress site to transform site visitors into newsletter subscribers. These forms are directly linked to your Zoho Campaigns account, allowing for automatic synchronization with your mailing lists.\n- **Automated Workflows with E-commerce Integration**: Zoho Campaigns seamlessly connects with your WooCommerce store, syncing customer data to support enhanced e-commerce marketing strategies. Automated workflows enable the deployment of targeted promotional emails, immediate responses to cart abandonment, and welcoming new customers with customized email series.\n- **CRM System Integration**: Leverage the ability to identify and advance top buyers directly into your CRM system, facilitating improved customer relationship management and targeted marketing initiatives.\n\n> **Note**: Some features such as CRM require the purhase of [Zoho CRM](https://www.zoho.com/crm/zohocrm-pricing.html) and [Zoho Flow](https://flow.zoho.com/)\n\n## Pricing\n\n> Adapted from [Zoho Campaigns Pricing](https://www.zoho.com/campaigns/pricing.html)\n\nThe Standard Plan is the cheapest plan which provides automated workflows (i.e. order status updates).\n\n### Free\n\n- Up to 2K contacts\n- 6,000 emails/month\n- Basic ready-made email templates\n\n### Standard (Recommended)\n\n- Price: ₹180 / $2.16 per month\n- Features:\n    - Unlimited emails\n    - Advanced ready-made email templates\n    - Basic drag-and-drop workflows\n    - SMS marketing\n\n### Professional\n\n- Price: ₹258.75 / $3.10 per month\n- Features:\n    - Unlimited emails\n    - 20 users\n    - Advanced drag-and-drop workflows\n    - Dynamic content\n    - Email polls and attachments\n    - Batch sending\n    - Recipient time zone sends\n    - Recipient optimal open time sends\n\n## Privacy policy\n\n> Adapted from [Zoho Campaigns Privacy Policy](https://www.zoho.com/privacy.html)\n\n### Key Points\n\nIf you handle other people’s data using Zoho apps, such as information about\nyour customers or employees, you are entrusting that data to Zoho Campaigns\nfor processing.\n\nYou own your data. You may access it, share it through third-party integrations,\nand request that we export or delete it.\n\nWe hold the data in your account as long as you choose to use Zoho Services.\nAfter you terminate your account, your data will be automatically deleted from\nour active database within 6 months and from our backups within 3 months\nafter that.\n\nWe will disclose personal information if it’s necessary to comply with a legal\nobligation, prevent fraud, enforce an agreement, or protect our users’ safety.\n\n### Collected information\n\n- Account signup\n    - name\n    - contact number\n    - email address\n    - company name\n    - country\n- Event registrations and other form submissions\n- Payment processing\n    - name\n    - contact information\n    - credit card information\n        -name and address of the cardholder\n        -expiry date\n        -last four digits\n- Testimonials\n    - When you post testimonials about Zoho products\n- Interactions with Zoho\n    - email, telephone, and chat conversations with Zoho sales and customer support professionals\n","n":0.046}}},{"i":5,"$":{"0":{"v":"WooCommerce","n":1},"1":{"v":"\nWooCommerce is a powerful, open-source e-commerce platform built on WordPress. It provides users with complete ownership of their store's content and data, underpinning a free and flexible solution enhanced by a global community.\n\n## Key Features & Benefits\n\n- **Thematic Flexibility:** Tailor your online storefront with themes that align closely with your brand and industry needs.\n- **Product Page Customization:** Quickly modify product pages using easy-to-integrate modular product blocks, perfect for showcasing a wide array of items including physical and digital goods, and subscription services.\n- **Developer Tools:** Developers can leverage extensive tools such as hooks, filters, a robust REST API, and webhooks to customize and extend functionalities.\n- **Conversion Optimization:** Enhance your revenue with a shopping cart experience designed for higher conversion rates.\n- **SEO Advantages:** Utilize WordPress's superior SEO capabilities to boost your store's visibility online.\n- **Centralized Management:** Oversee store operations and track key performance metrics through the WooCommerce Admin dashboard.\n- **Payment Options:** Choose from various payment methods including WooPayments and over 100 other gateways like Stripe and PayPal.\n- **Shipping Solutions:** Manage your logistics effortlessly with WooCommerce Shipping, offering label printing and pickup scheduling directly from your dashboard, alongside integrations with major carriers like UPS and FedEx.\n- **Automated Tax Calculations:** Integrate services such as WooCommerce Tax to handle sales tax computations automatically.\n- **Business Tools Integration:** Utilize built-in tools and popular integrations with platforms like Google Ads and HubSpot to streamline your business operations.\n- **Extensive Extensions:** Access a wide range of both free and premium extensions through the official WooCommerce Marketplace, ensuring high standards with regular vetting and reviews.\n- **On-the-Go Operations:** Manage your store anywhere with the free WooCommerce mobile app available for both Android and iOS platforms, complete with instant sale notifications.\n- **Global Community:** Connect with a rapidly expanding global community through WooCommerce Meetups and WordCamps.\n- **Open Contributions:** Join hundreds of contributors in enhancing WooCommerce by participating in the development on the WooCommerce GitHub Repository and assist in localizing the platform via translate.wordpress.org\n","n":0.056}}},{"i":6,"$":{"0":{"v":"RazorPay","n":1},"1":{"v":"\nThe Razorpay payment gateway plugin for WooCommerce offers a comprehensive solution for online merchants looking to enhance their customer payment options. This plugin supports a wide array of payment methods and is specifically tailored to meet the needs of businesses operating in India .\n\n## Key Features\n\n- **Based in India**: Accepts payments via domestic and international credit cards (Visa, MasterCard, American Express), debit cards, EMIs (Equated Monthly Installment), net banking, UPI (Unified Payments Interface), and mobile wallets like RazorPay, GooglePay ,Paytm, JioMoney, and Mobikwik.\n- **Malaysia**: Supports FPX (Financial Process Exchange), DuitNow, and eWallets including GrabPay, Touch 'n Go eWallet, and Boost.\n- **Global Payments**: Enables transactions in multiple currencies, allowing international customers to pay in their local currency, enhancing the user experience and potentially increasing conversion rates.\n- **Integration and Security**: Seamlessly integrates with WooCommerce versions 3.0 and higher, ensuring compatibility with the latest web technologies and security standards, including PCI DSS compliance for secure transactions.\n- **Cost Efficiency**: Transparent pricing with no setup fees, no monthly charges, and competitive transaction fees. Merchants pay only for successful transactions.\n- **Enhanced Checkout Experience**: Provides a streamlined checkout process, reducing cart abandonment rates with features like auto-fill, saved card details, and a mobile-friendly interface.\n- **Subscription Payments**: Fully supports the WooCommerce Subscriptions extension to handle recurring payments, allowing businesses to offer subscription-based products or services.\n- **Affordability Widget**: Introduces an affordability widget at checkout that displays various EMI options available for the transaction, helping customers make informed decisions regarding their purchases.\n- **Installation and Configuration**: Simple setup through the WooCommerce settings panel, with detailed documentation available to guide merchants through the configuration process.\n- **Support and Licensing**: Offers comprehensive support via email, chat, and an extensive knowledge base. Licensed under GPL, aligning with WordPress’s open-source philosophy.\n\n## Pricing\n\n> Adapted from [RazorPay Pricing](https://razorpay.com/pricing/)\n\nRazorPay takes 2% of every transaction. Transactions made with Diners, Amex Cards, International cards, EMI, and Corporate cards will be charged 3%\n","n":0.057}}},{"i":7,"$":{"0":{"v":"Fancy Product Designer","n":0.577},"1":{"v":"\nFancy Product Designer is used for customizing the visiting card templates adn sending the customized versions to the vendors.\n\n> **Note**: While many other options exist that accomplish the same task, Fancy Product Designer is one of few which integrates with multiple vendors.\n\n## Pricing\n\n> Adapted from: [Fancy Product Designer Pricing](https://fancyproductdesigner.com/pricing/)\n\n$59.00 per license (needed to install to the website)\n\n$19 per month (needed to send vendors customized images in a vectorized format)\n","n":0.12}}},{"i":8,"$":{"0":{"v":"Dokan","n":1},"1":{"v":"\nDokan manages vendors and provides the vendor dashboard page. Alternative solutions are tailored towards a marketplace where vendors each add their own products to sell. Dokan is the only solution\n\n## Links\n\n- [MundoCards Vendor Dashboad](https://mundocards.wpcomstaging.com/vendor_dashboard)\n- [Dokan Dashboard](https://mundocards.wpcomstaging.com/wp-admin/admin.php?page=dokan#/)\n    - Overview\n- [Settings](https://mundocards.wpcomstaging.com/wp-admin/admin.php?page=dokan#/settings)\n    - Set commission\n    - Fees\n    - Payment options\n\n## Key Features\n\nDokan is a robust frontend multi-vendor marketplace plugin for WordPress, leveraging WooCommerce to allow users to build their own marketplace. Modeled after major eCommerce platforms like Amazon and eBay, Dokan simplifies the process of creating a comprehensive marketplace, enabling setups in less than 30 minutes. This platform is ideal for launching an eCommerce business, allowing owners to earn through various commission models with support for a range of product types including digital, physical, and variable products.\n\n- **Quick and Easy Setup:** Deploy a fully functional marketplace quickly with a setup process designed to take less than an hour.\n- **Comprehensive Vendor Management:** Each vendor receives a personalized, customizable dashboard for managing their part of the marketplace directly from the frontend.\n- **Advanced Marketplace Features:** Support for unlimited vendors and products, including physical, downloadable, variable, and bookable products through additional integrations like Dokan WC Bookings and Dokan Simple Auctions.\n- **Dynamic Shipping Options:** Vendor-specific shipping controls and integrations with popular shipping platforms like ShipStation, providing tailored shipping solutions.\n- **Multiple Revenue Streams:** Owners can earn through vendor commissions, product-based commissions, and subscription packs for vendor activities.\n- **High Compatibility:** Works seamlessly with over 70+ plugins and 71+ themes, ensuring smooth operation within the WordPress ecosystem.\n- **Mobile App Integration:** Enhances the shopping experience through real-time order tracking and delivery management with the Dokan mobile app.\n- **Community and Support:** Regular updates and access to a dedicated community and extensive documentation to assist users in maximizing the platform's potential.\n- **Administrative Control:** Detailed control over marketplace settings such as product publishing, vendor registration, and subscription management.\n- **Additional Pro Features:** Access to vendor analytics, advanced SEO management, live chat support, and enhanced payment options like Stripe Connect, PayPal Marketplace, and RazorPAY.\n\n## Pricing\n\n> Adapted from [Dokan Pricing](https://dokan.co/wordpress/pricing/)\n\nPricing is identical in India and the US, however since sales tax is 18% in India, it would be more cost effective to purchase from the US.\n\nThe **Business Plan** is the only plan which meets all requirements for MundoCards since it is the cheapest subscription which provides vendor geolocation (which allows customer to search for vendor based on location).\n\n**Price**: ₹51,788.00 / $619.52 (18% tax included)\n\n**Features**:\n\n- Vendor geolocation\n- Single product, multiple vendors\n\n## Privacy Policy\n\n> Adapted from [Dokan India Privacy Policy](https://www.dokan.co.in/privacy-policy-for-dokan-delivery-partner)\n\n### Key points\n\nDokan may use your *Personal Data* to contact you with newsletters, marketing or promotional materials and other information that may be of interest to you. They may use *Usage Data* for internal analysis purposes and may use third-party Service Providers to monitor and analyze the use of Dokan.\n\nIf you are located outside India and choose to provide information to Dokan, please note that Dokan will transfer the data, including Personal Data, to India and process it there.\n\nIf Dokan or its subsidiaries are involved in a merger, acquisition or asset sale, your Personal Data may be transferred.\n\nNo method of transmission over the Internet or method of electronic storage is 100% secure. Dokan strives to use commercially acceptable means to protect your Personal Data, but **cannot guarantee its absolute security**.\n\n### Collected information\n\n- Personal data (about MundoCards)\n    - Email address\n    - First name and last name\n    - Phone number\n    - Address, Country, State, Province, ZIP/Postal code, City\n- Cookies and Usage Data\n    - IP address\n    - Web browser info\n    - the time, date, and duration you visit the Dokan website\n- Location data (opt in)\n","n":0.041}}},{"i":9,"$":{"0":{"v":"📃  Overview","n":0.707},"1":{"v":"\n## Quick Links\n\n- [MundoCards Homepage](https://mundocards.wpcomstaging.com/)\n- [WordPress Dashboard](https://mundocards.wpcomstaging.com/wp-admin/)\n- [Project Task Board](https://github.com/users/Ethab83/projects/1)\n\n## Definitions\n\n- **API**: Application Programming Interface\n- **E-commerce**: Electronic commerce\n- **iOS**: iPhone OS (Operating System)\n- **MVC**: Model, View, Controller\n- **MVP**: Minimum Viable Product\n- **SaaS**: Software as a Service\n- **UI**: User Interface\n- **WC**: WooComerce (e-commerce platform on top of WP)\n- **WP**: WordPress\n\n## Scope\n\n- **MundoCards Web-App**: A WP/WC SaaS web-app that facilitates on-demand printing services for consumers and local printers in emerging markets. The platform aims to aggregate consumer demand and automate the printers’ workflows through a SaaS web portal. The website should have a User-friendly UI and a secured payment API.\n- **Consumer-end**: The business card designer software will be used to customize business cards that will be sold using the MundoPrints platform. The software will make it simple for customers to use MundoPrints from any device (mobile/desktop) easily.\n- **Producer-end**: The printers/vendors will use a dashboard to manage their orders and product stock.\n\n## Overview\n\nThis project (MundoCards), is for a Software Engineering class project at UMass Boston. Through the MundoCards platform, the user can customize their Business Cards according to their own requirements. Our task is to build an efficient website to incorporate as many customization features as we can for the business cards and secured payment process.\n\n## Limitations\n\nNavigating the regulatory landscape across different countries can be challenging, with varying standards, taxes, and import/export regulations potentially complicating operations and expansion plans. One problem like this that we have run into was initially we were using a US-based WP website. However, we ended up switching this to an India-based WP website, because it was both cheaper, and more fitting. We will soon be implementing the payment system, and it will be important to make sure that the prices are shown in rupees instead of dollars.\n\nManaging an efficient supply chain across diverse and sometimes remote areas can be complex, with risks of delays, increased costs, and logistical challenges affecting the timely delivery of services. This may not be much of a concern for us, since it will take too long to track the entire order fulfillment before the final deadline.\n\nManaging the services, and website across different regions due to language barriers. Since the site is targeted towards the Indian market, it will be a challenge to make sure everything looks right.\n\nEnsuring consistency with the product quality and packaging across all the different regions we are providing services to.\n\nWP itself presents many limitations which are pay-walled behind subscriptions. We have run into several problems with limitations of some subscription levels, however with out current subscription, there are no further issues.\n\n## Requirements\n\nThe most important requirement of this project is to create a user-friendly web-app that enables customers to customize their business cards according to their needs. To implement the website we are using WP.\n\nThe web-app must have a product navigation and customization UI for customers, and an orders dashboard for printing vendors.\n\nThe payment process must be smooth and secure for safety and reliability purposes. For this we are using WP plugins WC and RazorPay.\n\nThe website should be functional on all sorts of devices including a desktop or a phone(iOS/Android) Thankfully WP makes this fairly easy.\nFrom the back-end perspective, the website should be able to connect the user with the local printers well, with all the order information and delivery notifications being sent to both parties at the same time. For this we are using the WP plugin called Zoho Campaigns.\nLastly, the website should also be able to track the details of the customers and store them in the database for future reference. For this we are using a WP plugin called JetPack.\n\n## Specifications\n\nThe software will be implemented on a website [MundoCards.com](https://mundocards.wpcomstaging.com/). It will be accessible from the homepage of it. The very first step in the process was to find out how we were going to build the website. We decided to use WP (with the Creator plan) because it could easily be used to implement the front-end design and add functionality through existing plugins. We copied the existing (unfinished) website. After obtaining the domain, we researched the specific plugins to implement (for payment processing, card customization, vendor dashboards, customer notification, etc.). Now, we are currently integrating the plugins to work seamlessly with the web-app.\n","n":0.038}}},{"i":10,"$":{"0":{"v":"Roles","n":1},"1":{"v":"\n\n- **QA/Testing Engineer**: Atharva Sachin Khadgi, [a.khadgi001@umb.edu](mailto:a.khadgi001@umb.edu)\n- **Team Manager**: Ethan Mulcahy (project supervisor), [ethan.mulcahy001@umb.edu](mailto:ethan.mulcahy001@umb.edu)\n- **Front-end Developer**: Khang Nguyen, [khang.nguyen008@umb.edu](mailto:khang.nguyen008@umb.edu)\n- **Content Manager**: Neha Agarwal, [neha.agarwal001@umb.edu](mailto:neha.agarwal001@umb.edu)\n- **Back-end Developer**: Ray Chen, [zhangzhe.chen001@umb.edu](mailto:zhangzhe.chen001@umb.edu)\n","n":0.186}}},{"i":11,"$":{"0":{"v":"Timeframe & Milestones","n":0.577},"1":{"v":"\n- **March 10th**: recieve the existing codebase for the old website. This will be our next big milestone as it will mark the start of our implementation phase.\n    - We initially received the website on March 6th. However there were many limitations with the subscription plan, so after researching possible solutions and deciding that purchasing a higher-tier subscription through WP India. It wasn’t until March 22nd when we received access to the final website.\n- **March 20th**: complete R&D for the existing integrations/plugins used, so that we can easily integrate them onto the new website.\n    - We were able to research the existing WP plugins by this deadline, though there are extra plugins we have added and have just one more plugin to research.\n- **April 25th**: produce a MVP for MundoCards.\n","n":0.088}}},{"i":12,"$":{"0":{"v":"Meeting Notes","n":0.707},"1":{"v":"\n> **Note**: Many meetings were either recorded or were simply not tracked with meeting notes, this is not a conprehensive list.\n\nSorted new to old\n\n## April 15\n\nIntroduction to CTO, getting up-to-date on the project.\n\n## March 25\n\n1. **Integration of Email Marketing Tools**:\n    - Implement Mailchimp for the U.S. market.\n    - Integrate Zoho Campaigns and Octane for the Indian market.\n2. Payment Gateway Implementation:\n    - Implement the Razorpay plugin for payment processing.\n3. Website Transition and Feature Implementation:\n    - Transition from the PHP site (mundoprints.in/old) to WordPress.\n    - Ensure the new WordPress site includes features like real-time customization of visiting cards, where entered information (e.g., names) is immediately displayed.\n4. Admin and Vendor Management:\n    - Include an admin dashboard for site management.\n    - Develop a vendor’s order management page to track and manage orders.\n5. Project Timeline Assessment:\n    - Assess whether the current deadline of April 3rd is feasible for completing these tasks.\n\n## March 6\n\nFocused on creating a new website using WordPress. Additionally, Lucia mentioned that we might seek help from designers around us to complete the template for visiting cards.\n\n## March 3\n\n- Make the website easy for phone use. (Might automatically adapts to the size of the phone.)\n- Vendor side implementation. Begin with it.\n- Website domain, whether to work on a new domain\n- Dimensions of the templet are very important.","n":0.068}}},{"i":13,"$":{"0":{"v":"Design","n":1},"1":{"v":"\nWe are first designing the actual UI and customization features with all the possible detailing to make the implementation of the front end easier. We are also coming up with the flow charts and discussing on the architecture and the required technologies to implement the back-end.\n\n## Use Cases\n\n![Use Case Diagram](assets/usecase_diagram.png)\n\nThe main clients of the software are small businesses and local printers in emerging markets. We connect small businesses to the local printers that are partnered with our site, allowing for operation sustainability. We’re also lookingto implement a phone application version of the website for Android/iOS, making it easier and more accessible to small businesses. The payment method implementation allows on-demand business card printing.\n\n### Actors\n\n- **Customer**: A user who needs printing services and interacts with the website to create customized products, place an order, and pay for the order.\n\n- **Local Printer Vendor**: A service provider who fulfills the printing orders placed by customers.\nUse cases:\n\n### Customer Use Case\n\n- **Sign Up**: New vendors register on the website to create an account with username and password.\n- **Log In**: Old vendors access their accounts to manage their activities on the website.\n- **Verify Password**: Part of the login process, the system validates user credentials.\n- **Show Login Error**: If the login attempt fails, the system displays an error message to the user.\n- **Customize Design**: Customers choose a design template or upload their own and personalize it with details like name, company information, etc.\n- **Place Order**: Once the design is customized, the customer proceeds to place the order for printing.\n- **Payment**: The customer completes the transaction by paying for the services through a secure payment gateway.\n- **Manage Order**: Local printer vendors access the system to manage and process the orders received.\n- **Receive Order**: After an order is processed, the local printer vendor updates the system, marking the order as complete when it’s ready for delivery or pickup.\n\n## Architecture\n\n![Activity Diagram](assets/activity_diagram.png)\n\nWe chose MVC architecture because it made the most sense for this application. The website is a type of online shopping platform, so it would be useful to have this architecture. The model in this case is a database to store information about customers and printers, as well as inventory, and available designs. As for deployment, it will be hosted on WP.\n\nThe exact implementation of the architecture is managed by WP. We chose WP because it made the most sense to copy the existing website (for other printed products) [MundoPrints.in](https://www.mundoprints.in/), to [MundoCards.com](https://mundocards.wpcomstaging.com/) and change it to meet the requirements\n\n\n## Technologies and Implementation Details\n\nSince we are using WP most of the implementation will be inside WP and WP plugins. We are using the Elementor plugin to develop the front-end. Elementor is a drag and drop editor which makes it fairly easy to create a web UI. For managing products and customers we are using WC. For the design page we are using Zakeke which is a tailor made plugin for printing template customization. For the payment processing, we are using the RazorPay plugin for WP. For notifying customers for order confirmation and delivery, we are using Zoho Campaigns. For managing vendors and\nimplementing the vendor dashboard, we are using WC Vendors.\n\n## User Interface\n\nDrawing inspiration from the layout of MundoPrints.in, which is still in development, we meticulously refined the user interface to cater specifically to our product offerings. Given the diverse range of products such as logo tees, brochures, and more, we carefully pruned unnecessary UI elements and crafted a new menu bar.\n\nOur revamped menu bar now boasts essential options such as 'Home', 'About Us', 'Contact', 'Privacy Policy', 'Vendor Login', and 'Cart', ensuring seamless navigation for our users. To accentuate the shopping experience, we strategically placed the cart logo adjacent to the menu bar, adding a visual cue for easy access.\n\nIn the product gallery, we sought to strike the perfect balance between aesthetics and functionality. Each product now features a concise description and clear price. Pixel-perfect adjustments ensure that the images are crisp and legible, elevating the overall visual appeal.To empower users with control over their browsing experience, we introduced 'Default Sorting' options and a button leading to a comprehensive product view. \n\nHarnessing the power of the 'Edit with Elementor' feature from WordPress, we seamlessly executed these enhancements, ensuring a user-centric design that is both elegant and intuitive.\n","n":0.038}}}]}
